case_study/pollutant_komegasst/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

kappa                0.41;          // (HW:p. 358)
Cmu                  0.09;          // (HW:p. 358)
flowDir              (1 0 0);       // (HW:Fig. 1)
zDir                 (0 0 1);       // (HW:Fig. 1)
Uref                 5.6;          // (HW:Table 1)
Zref                 0.66;           // (HW:Table 1)
z0                   uniform 0.0007;  // (HW:Table 1)
d                    uniform 0.0;
zGround			uniform 0.0;

// ************************************************************************* //
