case_study/pollutant_komegasst/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{


#include            "include/ABLConditions"
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
       
        type            nutkWallFunction;
        kappa           $kappa;
        Cmu             $Cmu;
        z0              $z0;
        value           uniform 0.0;
    }

   

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

  

 building
    {
      
        type         nutkWallFunction; 
        kappa           $kappa;
        Cmu             $Cmu;
        z0              $z0;
        value           uniform 0.0;
    }
    
   
    frontAndBack
    {
        type            symmetry;
    }


}

// ************************************************************************* //
